app/views/users/show.html.erb

	<div class="col-md-6">
		<% if @user.microposts.any? %>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 102], ["LIMIT", 1]]