app/views/shared/_micropost_form.html.erb

SELECT  "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

        	<%Course.all.each do |cou|%>