app/views/shared/_user_info.html.erb

<span><%= link_to "个人信息", current_user %></span>
<span><%= current_user.microposts.count.to_s+" 已选课程"%></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 102]]