app/controllers/microposts_controller.rb

  def create

    message=""
    repeat_course=0

    params[:courses].each do |cou|

      if(current_user.microposts.find_by(content: get_abstract(cou))==nil)

        @micropost = current_user.microposts.build(content: get_abstract(cou))

        if @micropost.save

          tmp_cou=Course.find_by(name:cou)
          tmp_cou.now_selected+=1
          tmp_cou.save
---
SELECT  "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."content" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["content", "工科数学分析"], ["LIMIT", 1]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123"], ["user_id", 1], ["created_at", "2017-10-04 02:45:29.740938"], ["updated_at", "2017-10-04 02:45:29.740938"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."name" = ? LIMIT ?  [["name", "工科数学分析"], ["LIMIT", 1]]
UPDATE "courses" SET "now_selected" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["now_selected", 1], ["updated_at", "2017-10-07 01:50:49.665381"], ["id", 1]]

  def destroy
    cou=@micropost.content.split(" || ")[0]

    #flash[:danger] = a

    tmp_cou=Course.find_by(name:cou)
    tmp_cou.now_selected-=1
    tmp_cou.save

    @micropost.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."name" = ? LIMIT ?  [["name", "数据结构"], ["LIMIT", 1]]
UPDATE "courses" SET "now_selected" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["now_selected", 0], ["updated_at", "2017-10-07 01:54:01.841627"], ["id", 2]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 1]]